<a href="https://colab.research.google.com/github/EZCHORA/Python_rajan_codes/blob/main/DS_Test2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import pandas as pd
import numpy as np

In [24]:
df = pd.read_csv("employees.csv")

In [46]:
df.fillna(method='ffill',inplace=True)

In [33]:
from datetime import datetime

In [34]:
def dateTime(x):
    dt=datetime.strptime(x,'%m/%d/%Y').strftime('%Y-%m-%d')
    return dt

In [35]:
df['Start Date']=df['Start Date'].apply(lambda x: dateTime(x))

In [39]:
df['Start Date']

0     1993-08-06
1     1996-03-31
2     1993-04-23
3     2005-03-04
4     1998-01-24
         ...
995   2014-11-23
996   1984-01-31
997   2013-05-20
998   2013-04-20
999   2012-05-15
Name: Start Date, Length: 1000, dtype: datetime64[ns]

In [37]:
import datetime as dt

In [38]:
df['Start Date']=pd.to_datetime(df['Start Date'])

In [40]:
df['day']=df['Start Date'].dt.day

In [41]:
df['month']=df['Start Date'].dt.month

In [42]:
df['year']=df['Start Date'].dt.year

In [44]:
del df['Start Date']

In [49]:
df

    First Name  Gender Last Login Time  ...  day  month  year
0      Douglas    Male        12:42 PM  ...    6      8  1993
1       Thomas    Male         6:53 AM  ...   31      3  1996
2        Maria  Female        11:17 AM  ...   23      4  1993
3        Jerry    Male         1:00 PM  ...    4      3  2005
4        Larry    Male         4:47 PM  ...   24      1  1998
..         ...     ...             ...  ...  ...    ...   ...
995      Henry    Male         6:09 AM  ...   23     11  2014
996    Phillip    Male         6:30 AM  ...   31      1  1984
997    Russell    Male        12:39 PM  ...   20      5  2013
998      Larry    Male         4:45 PM  ...   20      4  2013
999     Albert    Male         6:24 PM  ...   15      5  2012

[1000 rows x 10 columns]

In [60]:
def feature_object(df):
  for col_name in df.columns:
    if (df[col_name].dtypes=='object'):
      df[col_name]=df[col_name].astype('category')
      df[col_name]=df[col_name].cat.codes
  return df

In [53]:
def feature_bool(df):
  for col_name in df.columns:
    if (df[col_name].dtypes=='bool'):
      df[col_name]=df[col_name].astype('category')
      df[col_name]=df[col_name].cat.codes
  return df

In [61]:
data=feature_object(df)

In [63]:
data

     First Name  Gender  Last Login Time  Salary  ...  Team  day  month  year
0            55       1              154   97308  ...     7    6      8  1993
1           189       1              535   61933  ...     7   31      3  1996
2           130       0               83  130590  ...     4   23      4  1993
3            90       1              172  138705  ...     4    4      3  2005
4           119       1              404  101004  ...     1   24      1  1998
..          ...     ...              ...     ...  ...   ...  ...    ...   ...
995          76       1              481  132483  ...     2   23     11  2014
996         153       1              504   42392  ...     4   31      1  1984
997         168       1              150   96914  ...     8   20      5  2013
998         119       1              403   60500  ...     0   20      4  2013
999           3       1              497  129949  ...     9   15      5  2012

[1000 rows x 10 columns]

In [65]:
X=data.drop('Salary',axis=1)
Y=data['Salary']

KeyError: ignored

     First Name  Gender  Last Login Time  Bonus %  ...  Team  day  month  year
0            55       1              154    6.945  ...     7    6      8  1993
1           189       1              535    4.170  ...     7   31      3  1996
2           130       0               83   11.858  ...     4   23      4  1993
3            90       1              172    9.340  ...     4    4      3  2005
4           119       1              404    1.389  ...     1   24      1  1998
..          ...     ...              ...      ...  ...   ...  ...    ...   ...
995          76       1              481   16.655  ...     2   23     11  2014
996         153       1              504   19.675  ...     4   31      1  1984
997         168       1              150    1.421  ...     8   20      5  2013
998         119       1              403   11.985  ...     0   20      4  2013
999           3       1              497   10.169  ...     9   15      5  2012

[1000 rows x 9 columns]

In [10]:
import datetime as dt

In [11]:
del df['Last Login Time']

In [13]:
df['Start Date']

0        8/6/1993
1       3/31/1996
2       4/23/1993
3        3/4/2005
4       1/24/1998
          ...
995    11/23/2014
996     1/31/1984
997     5/20/2013
998     4/20/2013
999     5/15/2012
Name: Start Date, Length: 1000, dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         1000 non-null   object
 1   Gender             1000 non-null   object
 2   Start Date         1000 non-null   object
 3   Salary             1000 non-null   int64
 4   Bonus %            1000 non-null   float64
 5   Senior Management  1000 non-null   bool
 6   Team               1000 non-null   object
dtypes: bool(1), float64(1), int64(1), object(4)
memory usage: 48.0+ KB